[
  {
    "type": "journal-article",
    "title": "Documenting Domination in International Relations Through the Doctrine of Discovery",
    "author": [
      {
        "given": "Adam DJ",
        "family": "Brett"
      },
      {
        "given": "Betty",
        "family": "Hill"
      }
    ],
    "issued": {
      "date-parts": [
        [
          2024
        ]
      ]
    },
    "container-title": "Cross Currents",
    "volume": 74,
    "page": "519--536",
    "URL": "https://doi.org/10.1353/cro.2024.a963640",
    "ISSN": "00111953",
    "abstract": "The American Indian Law Alliance (AILA) was founded in 1989 by Tonya Gonnella Frichner as an Indigenous, non-profit organization advocating for sovereignty, human rights, and social justice for Indigenous peoples. AILA works at the international level to support and advocate for Indigenous nations. In 2010, Gonnella Frichner submitted a Preliminary Study on The Impact on Indigenous Peoples of The Doctrine of Discovery to the United Nations. The study highlighted the ongoing effects of the Doctrine of Discovery on Indigenous peoples globally. AILA continues to call for a follow-up study by the United Nations. The organization also works to dismantle the Doctrine of Discovery through advocacy and collaboration with other organizations. Here, Brett and Hill discuss the history of the Doctrine of Discovery, the work of Indigenous nations in international diplomacy, and the importance of shifting from a rights-based approach to a responsibility-based approach. He emphasize the need for collective action to challenge the Doctrine of Discovery and create a more just and sustainable world.",
    "keyword": [
      "Advocacy",
      "American Indians",
      "Collective action",
      "Diplomacy",
      "Discovery",
      "Human rights",
      "Indigenous peoples",
      "Interagency collaboration",
      "International relations",
      "Native North Americans",
      "Native rights",
      "Nonprofit organizations",
      "Onondaga Lake",
      "Philosophy",
      "Racial justice",
      "Social justice",
      "Sovereignty",
      "United States--US"
    ]
  }
]